{% extends 'base.html' %}

{% block body %}
{% include 'nav.html' %}

<div class="container">
{% include 'notif.html' %}

    <h2>Aide</h2>

    <hr><div class="alert alert-info" role="alert">Cette page devrait &ecirc;tre lue attentivement avant d'utiliser cette interface.</div>

    <hr><h4>Cr&eacute;er un compte mail</h4>

    <p>Vous devez choisir un mot de passe et &eacute;ventuellement des alias. Veillez &agrave; entrer des alias avec une syntaxe valide et un mot de passe valide et assez complexe. Vous pouvez &eacute;galement choisir de donner les droits "Admin" en cochant la case <i>Admin</i>, c'est-&agrave;-dire permettre &agrave; l'utilisateur de se connecter &agrave; cette interface pour pouvoir ajouter/supprimer des mails/alias.<br>
    <b>Vous devez &eacute;galement choisir un Login qui ne sera plus modifiable par la suite.</b> Ce login et le mot de passe serviront &agrave; se connecter au Webmail, serveur SMTP, serveur POP et serveur IMAP et &eacute;ventuellement &agrave; cette interface (si l'utilisateur a les droits "Admin").
    </p>

    <hr><h4>Cr&eacute;er un alias</h4>

    <p>Vous devez choisir un alias et un mail valide pour rediriger les mails. Prenez bien garde &agrave; entrer un mail valide sinon les mails ne vous parviendront jamais.</p>

    <hr><h3>FAQ</h3>

    <hr><div class="alert alert-info" role="alert">Cette Foire-Aux-Questions (FAQ) devrait répondre à vos questions. Si ce n'est pas le cas, posez vos questions à <a href="mailto:{{ notif_mail }}">{{ notif_mail }}</a>.</div>

    <hr><h4>Qu'est-ce qu'une syntaxe valide pour un compte mail ?</h4>

    <i>Le d&eacute;but du mail (avant le @), doit respecter les r&egrave;gles suivantes :
    <ul>
    <li>&ecirc;tre compris entre 3 et 30 caract&egrave;res</li>
    <li>n'avoir que des caract&egrave;res de types lettre minuscules ou chiffres</li>
    <li>les caract&egrave;res tiret (-), point (.) et underscore (_) sont permis sauf en d&eacute;but et fin</li>
    </ul>
    </i>

    <hr><h4>Qu'est-ce qu'un mot de passe valide ?</h4>

    <i>Votre mot de passe doit r&eacute;pondre aux r&egrave;gles suivantes :
    <ul>
    <li>avoir entre 5 et 100 caract&egrave;res</li>
    <li>N'utiliser que des espaces (sauf en début ou fin), des carac&egrave;res imprimables c'est-&agrave;-dire des lettres (majuscules, minuscules ou accentu&eacute;es), des chiffres ou les caract&egrave;res suivants :
    <pre>[]!"#$%&'()*+,-./:;<=>?@\^_`{|}~</pre>
    </ul>
    </i>

    <hr><h4>Qu'est-ce qu'un mot de passe assez complexe ?</h4>

    <i>Outre d'avoir un mot de passe assez long (voir question pr&eacute;c&eacute;dente), il est fortement conseill&eacute; d'utilis&eacute; au moins un chiffre, au moins une lettre minuscule, au moins une lettre majuscule et au moins un caract&egrave;res "sp&eacute;cial". De plus, l'utilisation de suites de caract&egrave;res "connues" (mots, dates, noms, etc.) est fortement d&eacute;conseill&eacute;e.</i>

</div>
{% endblock %}
